<a href="https://colab.research.google.com/github/rajkumar1234-yeddu/DA-python-pandas-dataframe-basics/blob/main/4thlab_9_12_2nd.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from pandas import DataFrame as df

# 1

In [ ]:
l = [[1,2,3,4], [6,7,8,9]]
data = df(l)
data

   0  1  2  3
0  1  2  3  4
1  6  7  8  9

In [ ]:
dic = {
    'one':[1,2,3,4],
    'two':[6,7,8,9]
}
data1 = df(dic)
data1

   one  two
0    1    6
1    2    7
2    3    8
3    4    9

In [ ]:
dic = {
    'one':[1,2,3,4],
    'two':[6,7,8,9]
}
data2 = df(dic, index=['a', 'b', 'c', 'd'])
data2

   one  two
a    1    6
b    2    7
c    3    8
d    4    9

In [ ]:
dic1 = {
    '1st':[1,3,5],
    '2nd':[2,4,6]
}
dic2 = {
    '1st':[1,2,3],
    'two':[6,7,8]
}
l1 = [dic1, dic2]
data = df(l1)
data

         1st        2nd        two
0  [1, 3, 5]  [2, 4, 6]        NaN
1  [1, 2, 3]        NaN  [6, 7, 8]

In [ ]:
dic1 = {
    '1st':[1,3,5],
    '2nd':[2,4,6]
}
dic2 = {
    '1st':[1,2,3],
    '2nd':[6,7,8]
}
l1 = [dic1, dic2]
data = df(l1, index=['dic1', 'dic2'])
data

            1st        2nd
dic1  [1, 3, 5]  [2, 4, 6]
dic2  [1, 2, 3]  [6, 7, 8]

In [ ]:
t1 = (1,2,3,4)
t2 = (7,8,9,0)
l1 = [t1, t2]
df(l1)

   0  1  2  3
0  1  2  3  4
1  7  8  9  0

In [ ]:
l1 = (1,2,3,4)
l2 = (6,7,8,9)
a = list(zip(l1, l2))
df(a)

   0  1
0  1  6
1  2  7
2  3  8
3  4  9

In [ ]:
data = df()
data

Empty DataFrame
Columns: []
Index: []

In [ ]:
#2
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}

dframe = df(data)
print(dframe)

a = dframe.sort_values(by = 'Section' ,ascending = True)
a

   Rollno Branch Section
0    1000    CSE       A
1    2000    ECE       B
2    3000    EEE       A
3    4000    MEC       C

   Rollno Branch Section
0    1000    CSE       A
2    3000    EEE       A
1    2000    ECE       B
3    4000    MEC       C

In [ ]:
#3
data = [[110, 128, 131], [1, 125, 84], [59, 2, 35]]
a = df(data)
max(a.max(axis = 'columns'))

131

In [ ]:
#4
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)
print(a)
#col = list((a.columns))
#print(col)
a.Section.unique()  #for one column 

(a['Rollno'].append(a['Branch']).append(a['Section'])).unique()  #for multiple columns

   Rollno Branch Section
0    1000    CSE       A
1    2000    ECE       B
2    3000    EEE       A
3    4000    MEC       C

array([1000, 2000, 3000, 4000, 'CSE', 'ECE', 'EEE', 'MEC', 'A', 'B', 'C'],
      dtype=object)

In [ ]:
#5
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

print(a.drop_duplicates(subset = ["Section"]))

   Rollno Branch Section
0    1000    CSE       A
1    2000    ECE       B
3    4000    MEC       C

In [ ]:
#6
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

a.rename(columns = {'Branch':'Dept'}, inplace = True)
a

   Rollno Dept Section
0    1000  CSE       A
1    2000  ECE       B
2    3000  EEE       A
3    4000  MEC       C

In [ ]:
#7
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)
a.where(a=='CSE')

   Rollno Branch Section
0     NaN    CSE     NaN
1     NaN    NaN     NaN
2     NaN    NaN     NaN
3     NaN    NaN     NaN

In [ ]:
#8
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

print(a.drop(['Rollno'], axis=1))

print(a.drop([0,3]))

  Branch Section
0    CSE       A
1    ECE       B
2    EEE       A
3    MEC       C
   Rollno Branch Section
1    2000    ECE       B
2    3000    EEE       A

In [ ]:
#9
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

print(a.filter(like='ec' ,axis=1))

print(a.filter(items=['Section', 'Rollno']))

  Section
0       A
1       B
2       A
3       C
  Section  Rollno
0       A    1000
1       B    2000
2       A    3000
3       C    4000

In [ ]:
#10
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html

In [ ]:
#11
normalize?

In [ ]:
#12
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

a["Year"] = ["2000", "2001", "2000", "1999"]
a

   Rollno Branch Section  Year
0    1000    CSE       A  2000
1    2000    ECE       B  2001
2    3000    EEE       A  2000
3    4000    MEC       C  1999

In [ ]:
#13
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

print(a.rank(ascending=True))

print(a.rank(ascending=False))

   Rollno  Branch  Section
0     1.0     1.0      1.5
1     2.0     2.0      3.0
2     3.0     3.0      1.5
3     4.0     4.0      4.0
   Rollno  Branch  Section
0     4.0     4.0      3.5
1     3.0     3.0      2.0
2     2.0     2.0      3.5
3     1.0     1.0      1.0

In [ ]:
#14
data = {
    "Rollno" : [1000, 2000, 3000, 4000],
    "Branch" : ["CSE", "ECE", "EEE", "MEC"],
    "Section" : ["A", "B", "A", "C"]
}
a = df(data)

new_row = {"Rollno" : 6000, "Branch" : "CSE", "Section" : "C"}
a = a.append(new_row, ignore_index=True)
a

   Rollno Branch Section
0    1000    CSE       A
1    2000    ECE       B
2    3000    EEE       A
3    4000    MEC       C
4    6000    CSE       C